nectvety-software/legacy-32-classic-E524546/firmware/pixeler/examples/ESP32S3/Legacy-32-Classic/.pio/libdeps/legacy32/pixeler/src/lib/server/FServer/FServer.cpp
/*
  FServer.cpp - Dead simple web-server.
  Supports only one simultaneous client, knows how to handle GET and POST.

  Copyright (c) 2014 Ivan Grokhotkov. All rights reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
  Modified 8 May 2015 by Hristo Gochkov (proper post and file upload handling)
*/
#pragma GCC optimize("O3")

#include "./FServer.h"

#include <Arduino.h>
#include <esp32-hal-log.h>
#include <libb64/cdecode.h>
#include <libb64/cencode.h>

#include "./FuncReqHandler.h"
#include "./mimetable.h"
#include "MD5Builder.h"
#include "NetworkClient.h"
#include "NetworkServer.h"
#include "SHA1Builder.h"
#include "base64.h"
#include "esp_random.h"

static const char AUTHORIZATION_HEADER[] = "Authorization";
static const char qop_auth[] PROGMEM = "qop=auth";
static const char qop_auth_quoted[] PROGMEM = "qop=\"auth\"";
static const char WWW_Authenticate[] = "WWW-Authenticate";
static const char Content_Length[] = "Content-Length";
static const char ETAG_HEADER[] = "If-None-Match";

namespace pixeler
{
  FServer::FServer(IPAddress addr, int port) : _server(addr, port)
  {
    log_i("FServer::FServer(addr=%s, port=%d)", addr.toString().c_str(), port);
  }

  FServer::FServer(int port) : _server(port)
  {
    log_i("FServer::FServer(port=%d)", port);
  }

  FServer::~FServer()
  {
    _server.close();

    _clearRequestHeaders();
    _clearResponseHeaders();

    ReqHandler* handler = _firstHandler;
    while (handler)
    {
      ReqHandler* next = handler->next();
      delete handler;
      handler = next;
    }
    _firstHandler = nullptr;
  }

  void FServer::begin()
  {
    close();
    _server.begin();
    _server.setNoDelay(true);
  }

  void FServer::begin(uint16_t port)
  {
    close();
    _server.begin(port);
    _server.setNoDelay(true);
  }

  String FServer::_extractParam(String& authReq, const String& param, const char delimit)
  {
    int _begin = authReq.indexOf(param);
    if (_begin == -1)
    {
      return "";
    }
    return authReq.substring(_begin + param.length(), authReq.indexOf(delimit, _begin + param.length()));
  }

  static String md5str(String& in)
  {
    MD5Builder md5 = MD5Builder();
    md5.begin();
    md5.add(in);
    md5.calculate();
    return md5.toString();
  }

  String FServer::_getRandomHexString()
  {
    char buffer[33];  // buffer to hold 32 Hex Digit + /0
    int i;
    for (i = 0; i < 4; i++)
    {
      sprintf(buffer + (i * 8), "%08lx", esp_random());
    }
    return String(buffer);
  }

  ReqHandler& FServer::on(const Uri& uri, FServer::THandlerFunction handler)
  {
    return on(uri, HTTP_ANY, handler);
  }

  ReqHandler& FServer::on(const Uri& uri, HTTPMethod method, FServer::THandlerFunction fn)
  {
    return on(uri, method, fn, _fileUploadHandler);
  }

  ReqHandler& FServer::on(const Uri& uri, HTTPMethod method, FServer::THandlerFunction fn, FServer::THandlerFunction ufn)
  {
    FuncReqHandler* handler = new FuncReqHandler(fn, ufn, uri, method);
    _addReqHandler(handler);
    return *handler;
  }

  bool FServer::removeRoute(const char* uri)
  {
    return removeRoute(String(uri), HTTP_ANY);
  }

  bool FServer::removeRoute(const char* uri, HTTPMethod method)
  {
    return removeRoute(String(uri), method);
  }

  bool FServer::removeRoute(const String& uri)
  {
    return removeRoute(uri, HTTP_ANY);
  }

  bool FServer::removeRoute(const String& uri, HTTPMethod method)
  {
    bool anyHandlerRemoved = false;
    ReqHandler* handler = _firstHandler;
    ReqHandler* previousHandler = nullptr;

    while (handler)
    {
      if (handler->canHandle(method, uri))
      {
        if (_removeReqHandler(handler))
        {
          anyHandlerRemoved = true;
          // Move to the next handler
          if (previousHandler)
          {
            handler = previousHandler->next();
          }
          else
          {
            handler = _firstHandler;
          }
          continue;
        }
      }
      previousHandler = handler;
      handler = handler->next();
    }

    return anyHandlerRemoved;
  }

  void FServer::addHandler(ReqHandler* handler)
  {
    _addReqHandler(handler);
  }

  bool FServer::removeHandler(ReqHandler* handler)
  {
    return _removeReqHandler(handler);
  }

  void FServer::_addReqHandler(ReqHandler* handler)
  {
    if (!_lastHandler)
    {
      _firstHandler = handler;
      _lastHandler = handler;
    }
    else
    {
      _lastHandler->next(handler);
      _lastHandler = handler;
    }
  }

  bool FServer::_removeReqHandler(ReqHandler* handler)
  {
    ReqHandler* current = _firstHandler;
    ReqHandler* previous = nullptr;

    while (current != nullptr)
    {
      if (current == handler)
      {
        if (previous == nullptr)
        {
          _firstHandler = current->next();
        }
        else
        {
          previous->next(current->next());
        }

        if (current == _lastHandler)
        {
          _lastHandler = previous;
        }

        // Delete 'matching' handler
        delete current;
        return true;
      }
      previous = current;
      current = current->next();
    }
    return false;
  }

  void FServer::handleClient()
  {
    if (_currentStatus == HC_NONE)
    {
      _currentClient = _server.accept();
      if (!_currentClient)
      {
        if (_nullDelay)
        {
          delay(1);
        }
        return;
      }

      log_v("New client: client.localIP()=%s", _currentClient.localIP().toString().c_str());

      _currentStatus = HC_WAIT_READ;
      _statusChange = millis();
    }

    bool keepCurrentClient = false;
    bool callYield = false;

    if (_currentClient.connected())
    {
      switch (_currentStatus)
      {
        case HC_NONE:
          // No-op to avoid C++ compiler warning
          break;
        case HC_WAIT_READ:
          // Wait for data from client to become available
          if (_currentClient.available())
          {
            _currentClient.setTimeout(HTTP_MAX_SEND_WAIT); /* / 1000 removed, WifiClient setTimeout changed to ms */
            if (_parseRequest(_currentClient))
            {
              _contentLength = CONTENT_LENGTH_NOT_SET;
              _responseCode = 0;
              _clearResponseHeaders();

              _handleRequest();

              if (_currentClient.isSSE())
              {
                _currentStatus = HC_WAIT_CLOSE;
                _statusChange = millis();
                keepCurrentClient = true;
              }
            }
          }
          else
          {  // !_currentClient.available()
            if (millis() - _statusChange <= HTTP_MAX_DATA_WAIT)
            {
              keepCurrentClient = true;
            }
            callYield = true;
          }
          break;
        case HC_WAIT_CLOSE:
          if (_currentClient.isSSE())
          {
            // Never close connection
            _statusChange = millis();
          }
          // Wait for client to close the connection
          if (millis() - _statusChange <= HTTP_MAX_CLOSE_WAIT)
          {
            keepCurrentClient = true;
            callYield = true;
          }
      }
    }

    if (!keepCurrentClient)
    {
      _currentClient = NetworkClient();
      _currentStatus = HC_NONE;
      _currentUpload.reset();
      _currentRaw.reset();
    }

    if (callYield)
    {
      yield();
    }
  }

  void FServer::close()
  {
    _server.close();
    _currentStatus = HC_NONE;
    if (!_headerKeysCount)
    {
      collectHeaders(0, 0);
    }
  }

  void FServer::stop()
  {
    close();
  }

  void FServer::sendHeader(const String& name, const String& value, bool first)
  {
    if (name.indexOf('\r') != -1 || name.indexOf('\n') != -1)
    {
      log_e("Invalid character in HTTP header name");
      return;
    }

    if (value.indexOf('\r') != -1 || value.indexOf('\n') != -1)
    {
      log_e("Invalid character in HTTP header value");
      return;
    }

    RequestArgument* header = new RequestArgument();
    header->key = name;
    header->value = value;

    if (!_responseHeaders || first)
    {
      header->next = _responseHeaders;
      _responseHeaders = header;
    }
    else
    {
      RequestArgument* last = _responseHeaders;
      while (last->next)
      {
        last = last->next;
      }
      last->next = header;
    }

    _responseHeaderCount++;
  }

  void FServer::setContentLength(const size_t contentLength)
  {
    _contentLength = contentLength;
  }

  void FServer::enableDelay(boolean value)
  {
    _nullDelay = value;
  }

  void FServer::enableCORS(boolean value)
  {
    _corsEnabled = value;
  }

  void FServer::enableCrossOrigin(boolean value)
  {
    enableCORS(value);
  }

  void FServer::chunkResponseBegin(const char* contentType)
  {
    if (_chunkedResponseActive)
    {
      log_e("Already in chunked response mode");
      return;
    }

    if (strchr(contentType, '\r') || strchr(contentType, '\n'))
    {
      log_e("Invalid character in content type");
      return;
    }

