nectvety-software/legacy-32-classic-E524546/firmware/pixeler/examples/ESP32S3/Legacy-32-Classic/.pio/libdeps/legacy32/pixeler/src/lib/server/FServer/FServer.cpp
    _chunkedResponseActive = true;
    _chunkedClient = _currentClient;

    _contentLength = CONTENT_LENGTH_UNKNOWN;

    String header;
    _prepareHeader(header, 200, contentType, 0);
    _currentClientWrite(header.c_str(), header.length());

    _chunkedResponseActive = true;
    _chunkedClient = _currentClient;
  }

  void FServer::chunkWrite(const char* data, size_t length)
  {
    if (!_chunkedResponseActive)
    {
      log_e("Chunked response has not been started");
      return;
    }

    char chunkSize[11];
    snprintf(chunkSize, sizeof(chunkSize), "%zx\r\n", length);

    if (_chunkedClient.write(chunkSize) != strlen(chunkSize))
    {
      log_e("Failed to write chunk size");
      _chunkedResponseActive = false;
      return;
    }

    if (_chunkedClient.write((const uint8_t*)data, length) != length)
    {
      log_e("Failed to write chunk data");
      _chunkedResponseActive = false;
      return;
    }

    if (_chunkedClient.write("\r\n") != 2)
    {
      log_e("Failed to write chunk terminator");
      _chunkedResponseActive = false;
      return;
    }
  }

  void FServer::chunkResponseEnd()
  {
    if (!_chunkedResponseActive)
    {
      log_e("Chunked response has not been started");
      return;
    }

    if (_chunkedClient.write("0\r\n\r\n", 5) != 5)
    {
      log_e("Failed to write terminating chunk");
    }

    _chunkedClient.clear();
    _chunkedResponseActive = false;
    _chunked = false;
    _chunkedClient = NetworkClient();

    _clearResponseHeaders();
  }

  void FServer::_prepareHeader(String& response, int code, const char* content_type, size_t contentLength)
  {
    _responseCode = code;

    response.concat(version());
    response.concat(' ');
    response.concat(String(code));
    response.concat(' ');
    response.concat(responseCodeToString(code));
    response.concat(F("\r\n"));

    using namespace mime;
    if (!content_type)
    {
      content_type = mimeTable[html].mimeType;
    }

    sendHeader(String(F("Content-Type")), String(FPSTR(content_type)), true);
    if (_contentLength == CONTENT_LENGTH_NOT_SET)
    {
      sendHeader(String(FPSTR(Content_Length)), String(contentLength));
    }
    else if (_contentLength != CONTENT_LENGTH_UNKNOWN)
    {
      sendHeader(String(FPSTR(Content_Length)), String(_contentLength));
    }
    else if (_contentLength == CONTENT_LENGTH_UNKNOWN && _currentVersion)
    {  // HTTP/1.1 or above client
      // let's do chunked
      _chunked = true;
      sendHeader(String(F("Accept-Ranges")), String(F("none")));
      sendHeader(String(F("Transfer-Encoding")), String(F("chunked")));
    }
    if (_corsEnabled)
    {
      sendHeader(String(FPSTR("Access-Control-Allow-Origin")), String("*"));
      sendHeader(String(FPSTR("Access-Control-Allow-Methods")), String("*"));
      sendHeader(String(FPSTR("Access-Control-Allow-Headers")), String("*"));
    }
    sendHeader(String(F("Connection")), String(F("close")));

    for (RequestArgument* header = _responseHeaders; header; header = header->next)
    {
      response.concat(header->key);
      response.concat(F(": "));
      response.concat(header->value);
      response.concat(F("\r\n"));
    }

    response.concat(F("\r\n"));
  }

  void FServer::send(int code, const char* content_type, const String& content)
  {
    String header;
    // Can we assume the following?
    // if(code == 200 && content.length() == 0 && _contentLength == CONTENT_LENGTH_NOT_SET)
    //  _contentLength = CONTENT_LENGTH_UNKNOWN;
    _prepareHeader(header, code, content_type, content.length());
    _currentClientWrite(header.c_str(), header.length());
    if (content.length())
    {
      sendContent(content);
    }
  }

  void FServer::send(int code, char* content_type, const String& content)
  {
    send(code, (const char*)content_type, content);
  }

  void FServer::send(int code, const String& content_type, const String& content)
  {
    send(code, (const char*)content_type.c_str(), content);
  }

  void FServer::send(int code, const char* content_type, const char* content)
  {
    const String passStr = (String)content;
    if (strlen(content) != passStr.length())
    {
      log_e("String cast failed.  Use send_P for long arrays");
    }
    send(code, content_type, passStr);
  }

  void FServer::send_P(int code, PGM_P content_type, PGM_P content)
  {
    size_t contentLength = 0;

    if (content != NULL)
    {
      contentLength = strlen_P(content);
    }

    String header;
    char type[64];
    memccpy_P((void*)type, (PGM_VOID_P)content_type, 0, sizeof(type));
    _prepareHeader(header, code, (const char*)type, contentLength);
    _currentClientWrite(header.c_str(), header.length());
    sendContent_P(content);
  }

  void FServer::send_P(int code, PGM_P content_type, PGM_P content, size_t contentLength)
  {
    String header;
    char type[64];
    memccpy_P((void*)type, (PGM_VOID_P)content_type, 0, sizeof(type));
    _prepareHeader(header, code, (const char*)type, contentLength);
    sendContent(header);
    sendContent_P(content, contentLength);
  }

  void FServer::sendContent(const String& content)
  {
    sendContent(content.c_str(), content.length());
  }

  void FServer::sendContent(const char* content, size_t contentLength)
  {
    const char* footer = "\r\n";
    if (_chunked)
    {
      char* chunkSize = (char*)malloc(11);
      if (chunkSize)
      {
        sprintf(chunkSize, "%x%s", contentLength, footer);
        _currentClientWrite(chunkSize, strlen(chunkSize));
        free(chunkSize);
      }
    }
    _currentClientWrite(content, contentLength);
    if (_chunked)
    {
      _currentClient.write(footer, 2);
      if (contentLength == 0)
      {
        _chunked = false;
      }
    }
  }

  void FServer::sendContent_P(PGM_P content)
  {
    sendContent_P(content, strlen_P(content));
  }

  void FServer::sendContent_P(PGM_P content, size_t size)
  {
    const char* footer = "\r\n";
    if (_chunked)
    {
      char* chunkSize = (char*)malloc(11);
      if (chunkSize)
      {
        sprintf(chunkSize, "%x%s", size, footer);
        _currentClientWrite(chunkSize, strlen(chunkSize));
        free(chunkSize);
      }
    }
    _currentClientWrite_P(content, size);
    if (_chunked)
    {
      _currentClient.write(footer, 2);
      if (size == 0)
      {
        _chunked = false;
      }
    }
  }

