nectvety-software/legacy-32-classic-E524546/firmware/pixeler/examples/ESP32S3/Legacy-32-Classic/.pio/libdeps/legacy32/pixeler/src/lib/server/FServer/FServer.cpp
  void FServer::_streamFileCore(const size_t fileSize, const String& fileName, const String& contentType, const int code)
  {
    using namespace mime;
    setContentLength(fileSize);
    if (fileName.endsWith(String(FPSTR(mimeTable[gz].endsWith))) && contentType != String(FPSTR(mimeTable[gz].mimeType)) && contentType != String(FPSTR(mimeTable[none].mimeType)))
    {
      sendHeader(F("Content-Encoding"), F("gzip"));
    }
    send(code, contentType, "");
  }

  String FServer::pathArg(unsigned int i) const
  {
    if (_currentHandler != nullptr)
    {
      return _currentHandler->pathArg(i);
    }
    return "";
  }

  String FServer::arg(const String& name) const
  {
    for (int j = 0; j < _postArgsLen; ++j)
    {
      if (_postArgs[j].key == name)
      {
        return _postArgs[j].value;
      }
    }
    for (int i = 0; i < _currentArgCount; ++i)
    {
      if (_currentArgs[i].key == name)
      {
        return _currentArgs[i].value;
      }
    }
    return "";
  }

  String FServer::arg(int i) const
  {
    if (i < _currentArgCount)
    {
      return _currentArgs[i].value;
    }
    return "";
  }

  String FServer::argName(int i) const
  {
    if (i < _currentArgCount)
    {
      return _currentArgs[i].key;
    }
    return "";
  }

  int FServer::args() const
  {
    return _currentArgCount;
  }

  bool FServer::hasArg(const String& name) const
  {
    for (int j = 0; j < _postArgsLen; ++j)
    {
      if (_postArgs[j].key == name)
      {
        return true;
      }
    }
    for (int i = 0; i < _currentArgCount; ++i)
    {
      if (_currentArgs[i].key == name)
      {
        return true;
      }
    }
    return false;
  }

  String FServer::header(const String& name) const
  {
    for (RequestArgument* current = _currentHeaders; current; current = current->next)
    {
      if (current->key.equalsIgnoreCase(name))
      {
        return current->value;
      }
    }
    return "";
  }

  void FServer::collectHeaders(const char* headerKeys[], const size_t headerKeysCount)
  {
    collectAllHeaders();
    _collectAllHeaders = false;

    _headerKeysCount += headerKeysCount;

    RequestArgument* last = _currentHeaders->next;

    for (int i = 2; i < _headerKeysCount; i++)
    {
      last->next = new RequestArgument();
      last->next->key = headerKeys[i - 2];
      last = last->next;
    }
  }

  String FServer::header(int i) const
  {
    RequestArgument* current = _currentHeaders;
    while (current && i--)
    {
      current = current->next;
    }
    return current ? current->value : emptyString;
  }

  String FServer::headerName(int i) const
  {
    RequestArgument* current = _currentHeaders;
    while (current && i--)
    {
      current = current->next;
    }
    return current ? current->key : emptyString;
  }

  int FServer::headers() const
  {
    return _headerKeysCount;
  }

  bool FServer::hasHeader(const String& name) const
  {
    return header(name).length() > 0;
  }

  String FServer::hostHeader() const
  {
    return _hostHeader;
  }

  void FServer::onFileUpload(THandlerFunction fn)
  {
    _fileUploadHandler = fn;
  }

  void FServer::onNotFound(THandlerFunction fn)
  {
    _notFoundHandler = fn;
  }

  bool FServer::_handleRequest()
  {
    bool handled = false;
    if (_currentHandler)
    {
      handled = _currentHandler->process(*this, _currentMethod, _currentUri);
      if (!handled)
      {
        log_e("request handler failed to handle request");
      }
    }
    // DO NOT LOG if _currentHandler == null !!
    // This is is valid use case to handle any other requests
    // Also, this is just causing log flooding
    if (!handled && _notFoundHandler)
    {
      _notFoundHandler();
      handled = true;
    }
    if (!handled)
    {
      using namespace mime;
      send(404, String(FPSTR(mimeTable[html].mimeType)), String(F("Not found: ")) + _currentUri);
      handled = true;
    }
    if (handled)
    {
      _finalizeResponse();
    }
    _currentUri = "";
    return handled;
  }

  void FServer::_finalizeResponse()
  {
    if (_chunked)
    {
      sendContent("");
    }
  }

  String FServer::responseCodeToString(int code)
  {
    switch (code)
    {
      case 100:
        return F("Continue");
      case 101:
        return F("Switching Protocols");
      case 200:
        return F("OK");
      case 201:
        return F("Created");
      case 202:
        return F("Accepted");
      case 203:
        return F("Non-Authoritative Information");
      case 204:
        return F("No Content");
      case 205:
        return F("Reset Content");
      case 206:
        return F("Partial Content");
      case 300:
        return F("Multiple Choices");
      case 301:
        return F("Moved Permanently");
      case 302:
        return F("Found");
      case 303:
        return F("See Other");
      case 304:
        return F("Not Modified");
      case 305:
        return F("Use Proxy");
      case 307:
        return F("Temporary Redirect");
      case 400:
        return F("Bad Request");
      case 401:
        return F("Unauthorized");
      case 402:
        return F("Payment Required");
      case 403:
        return F("Forbidden");
      case 404:
        return F("Not Found");
      case 405:
        return F("Method Not Allowed");
      case 406:
        return F("Not Acceptable");
      case 407:
        return F("Proxy Authentication Required");
      case 408:
        return F("Request Time-out");
      case 409:
        return F("Conflict");
      case 410:
        return F("Gone");
      case 411:
        return F("Length Required");
      case 412:
        return F("Precondition Failed");
      case 413:
        return F("Request Entity Too Large");
      case 414:
        return F("Request-URI Too Large");
      case 415:
        return F("Unsupported Media Type");
      case 416:
        return F("Requested range not satisfiable");
      case 417:
        return F("Expectation Failed");
      case 500:
        return F("Internal Server Error");
      case 501:
        return F("Not Implemented");
      case 502:
        return F("Bad Gateway");
      case 503:
        return F("Service Unavailable");
      case 504:
        return F("Gateway Time-out");
      case 505:
        return F("HTTP Version not supported");
      default:
        return F("");
    }
  }

  void FServer::_clearResponseHeaders()
  {
    _responseHeaderCount = 0;
    RequestArgument* current = _responseHeaders;
    while (current)
    {
      RequestArgument* next = current->next;
      delete current;
      current = next;
    }
    _responseHeaders = nullptr;
  }

