nectvety-software/legacy-32-classic-E524546/firmware/pixeler/examples/ESP32S3/Legacy-32-Classic/.pio/libdeps/legacy32/pixeler/src/lib/server/FServer/FServer.cpp
  void FServer::_clearRequestHeaders()
  {
    _headerKeysCount = 0;
    RequestArgument* current = _currentHeaders;
    while (current)
    {
      RequestArgument* next = current->next;
      delete current;
      current = next;
    }
    _currentHeaders = nullptr;
  }

  void FServer::collectAllHeaders()
  {
    _clearRequestHeaders();

    _currentHeaders = new RequestArgument();
    _currentHeaders->key = FPSTR(AUTHORIZATION_HEADER);

    _currentHeaders->next = new RequestArgument();
    _currentHeaders->next->key = FPSTR(ETAG_HEADER);

    _headerKeysCount = 2;
    _collectAllHeaders = true;
  }

  const String& FServer::responseHeader(String name) const
  {
    for (RequestArgument* current = _responseHeaders; current; current = current->next)
    {
      if (current->key.equalsIgnoreCase(name))
      {
        return current->value;
      }
    }
    return emptyString;
  }

  const String& FServer::responseHeader(int i) const
  {
    RequestArgument* current = _responseHeaders;
    while (current && i--)
    {
      current = current->next;
    }
    return current ? current->value : emptyString;
  }

  const String& FServer::responseHeaderName(int i) const
  {
    RequestArgument* current = _responseHeaders;
    while (current && i--)
    {
      current = current->next;
    }
    return current ? current->key : emptyString;
  }

  bool FServer::hasResponseHeader(const String& name) const
  {
    return header(name).length() > 0;
  }

  int FServer::clientContentLength() const
  {
    return _clientContentLength;
  }

  const String FServer::version() const
  {
    String v;
    v.reserve(8);
    v.concat(F("HTTP/1."));
    v.concat(_currentVersion);
    return v;
  }

  int FServer::responseCode() const
  {
    return _responseCode;
  }

  int FServer::responseHeaders() const
  {
    return _responseHeaderCount;
  }
}  // namespace pixeler
